<img src="../../predictioNN_Logo_JPG(72).jpg" width=200>

---

## Table Joins in a Relational Database

### Introduction to Data Science
### Last Updated: March 14, 2023
---  

### OBJECTIVES
- Understand how to join tables in a relational database
- Differentiate between different types of joins

### CONCEPTS
- left join
- inner join

---

### I. Table Joins

Joining tables allows you to use data from multiples tables that is common to records.

Run the cells below and fill in the missing code to accomplish the tasks.

You might want to use the sqlite lecture notes as a reference.

In [2]:
# import the SQLite API
import sqlite3

In [2]:
# create some data
company_hq = [
        ('AMZN','Seattle'),
        ('AAPL','Cupertino'),
        ('GOOG','Mountain View')]

company_ceos = [
        ('AMZN','Andy Jassy'),
        ('AAPL','Tim Cook')]

In [3]:
# set path to the database; modify to match your path; use forward slashes '/' in Python
PATH_TO_DB = "C:/Users/apt4c/Documents/database/sqlite/stocks.db"

In [4]:
# create db connection
conn = sqlite3.connect(PATH_TO_DB)

# create cursor
cur = conn.cursor()

Create a table in the db called `hq` and pass schema (ticker text, location text).  
End the transaction with a commit.

Create a table in the db called `ceo` and pass schema (ticker text, ceo text).  
End the transaction with a commit.

Insert the records into the `hq` table

Insert the records into the `ceo` table

Query each table to make sure all the data has been loaded

**TABLE JOIN**  
Join the two tables together, printing records with columns: ticker, location, ceo

In [22]:
for row in conn.execute('SELECT hq.ticker, hq.location, ceo.ceo_name \
                        FROM ceo INNER JOIN hq \
                        ON hq.ticker = ceo.ticker'):
    print(row)

('AMZN', 'Seattle', 'Andy Jassy')
('AAPL', 'Cupertino', 'Tim Cook')

Things to notice:
- `hq.ticker` means select field `ticker` from table `hq`. this makes the selection clear.
- an `INNER JOIN` only returns records appearing in both tables
- `ON` specifies how records are matched across tables

---

**TRY AND DISCUSS**

Change INNER JOIN to LEFT JOIN, run the query, and notice the result. Explain the difference and why it happens.

---

### Summary

Now that you know how to join tables, you can build larger, more informative data sets.

This will expand what you can do as a data scientist!

---

### Appendix: Illustration of Different Joins

Create tables

In [5]:
cur.execute('CREATE TABLE left (id int, first_name string, favorite_pet string);')
conn.commit()

cur.execute('CREATE TABLE right (id int, first_name string, favorite_number int);')
conn.commit()

Create and insert data

In [6]:
data_left = [
        (0, 'Taylor', 'rabbit'),
        (1, 'Chris', 'cat'),
        (2, 'Bono', 'dog')]

data_right = [
        (1, 'Chris', 314),
        (2, 'Bono', 5),
        (3, 'Cher', 12)]

cur.executemany('INSERT INTO left VALUES (?,?,?);', data_left)
conn.commit()

cur.executemany('INSERT INTO right VALUES (?,?,?);', data_right)
conn.commit()

Verify the data

In [7]:
for row in conn.execute('SELECT * FROM left;'):
    print(row)

print('')
for row in conn.execute('SELECT * FROM right;'):
    print(row)

(0, 'Taylor', 'rabbit')
(1, 'Chris', 'cat')
(2, 'Bono', 'dog')

(1, 'Chris', 314)
(2, 'Bono', 5)
(3, 'Cher', 12)

Left Join

In [8]:
for row in conn.execute('SELECT left.id, \
                                left.first_name, \
                                left.favorite_pet, \
                                right.favorite_number \
                        FROM left LEFT JOIN right \
                        ON left.id = right.id'):
    print(row)

(0, 'Taylor', 'rabbit', None)
(1, 'Chris', 'cat', 314)
(2, 'Bono', 'dog', 5)

Right Join (reverse tables as Python doesn't support right join)

In [9]:
for row in conn.execute('SELECT right.id, \
                                right.first_name, \
                                left.favorite_pet, \
                                right.favorite_number \
                        FROM right LEFT JOIN left \
                        ON left.id = right.id'):
    print(row)

(1, 'Chris', 'cat', 314)
(2, 'Bono', 'dog', 5)
(3, 'Cher', None, 12)

Inner Join

In [10]:
for row in conn.execute('SELECT left.id, \
                                left.first_name, \
                                left.favorite_pet, \
                                right.favorite_number \
                        FROM left INNER JOIN right \
                        ON left.id = right.id'):
    print(row)

(1, 'Chris', 'cat', 314)
(2, 'Bono', 'dog', 5)

Drop Tables

In [11]:
conn.execute('drop table left;')
conn.execute('drop table right;')